{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          1
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "\"": 4,
      "A": 5,
      "C": 6,
      "G": 7,
      "N": 8,
      "R": 9,
      "T": 10,
      "U": 11,
      "X": 12,
      "Y": 13,
      "t": 14,
      "Ċ": 15,
      "č": 16,
      "Ġ": 17,
      "GG": 18,
      "CC": 19,
      "AA": 20,
      "GC": 21,
      "GA": 22,
      "GT": 23,
      "TT": 24,
      "CA": 25,
      "UU": 26,
      "čĊ": 27,
      "TA": 28,
      "GAA": 29,
      "GU": 30,
      "CT": 31,
      "GGA": 32,
      "GCC": 33,
      "GCA": 34,
      "CU": 35,
      "CGG": 36,
      "CCA": 37,
      "TGG": 38,
      "CGA": 39,
      "CAA": 40,
      "TGT": 41,
      "UA": 42,
      "CGT": 43,
      "TTA": 44,
      "CGC": 45,
      "GGGT": 46,
      "ĠGG": 47,
      "TCC": 48,
      "AAA": 49,
      "GUU": 50,
      "GAAA": 51,
      "ĠA": 52,
      "CTT": 53,
      "GAGG": 54,
      "GUA": 55,
      "TGC": 56,
      "TCT": 57,
      "CTA": 58,
      "GAU": 59,
      "TCA": 60,
      "GGGG": 61,
      "UAA": 62,
      "GCGA": 63,
      "GTGT": 64,
      "GCCA": 65,
      "TAA": 66,
      "CUA": 67,
      "CUU": 68,
      "GTA": 69,
      "CACC": 70,
      "CGU": 71,
      "GGAA": 72,
      "GAGA": 73,
      "GCU": 74,
      "CGAA": 75,
      "GCAA": 76,
      "TGA": 77,
      "GCUU": 78,
      "TTTT": 79,
      "GCGG": 80,
      "CGGA": 81,
      "CAGG": 82,
      "CGTA": 83,
      "UGG": 84,
      "UCC": 85,
      "AAAA": 86,
      "CCCC": 87,
      "TTCAA": 88,
      "CGCC": 89,
      "CGCA": 90,
      "UUA": 91,
      "GTAA": 92,
      "GUAGG": 93,
      "GGT": 94,
      "GCTT": 95,
      "GCTTA": 96,
      "GAT": 97,
      "GATA": 98,
      "GTCA": 99
    },
    "merges": [
      [
        "G",
        "G"
      ],
      [
        "C",
        "C"
      ],
      [
        "A",
        "A"
      ],
      [
        "G",
        "C"
      ],
      [
        "G",
        "A"
      ],
      [
        "G",
        "T"
      ],
      [
        "T",
        "T"
      ],
      [
        "C",
        "A"
      ],
      [
        "U",
        "U"
      ],
      [
        "č",
        "Ċ"
      ],
      [
        "T",
        "A"
      ],
      [
        "G",
        "AA"
      ],
      [
        "G",
        "U"
      ],
      [
        "C",
        "T"
      ],
      [
        "GG",
        "A"
      ],
      [
        "G",
        "CC"
      ],
      [
        "GC",
        "A"
      ],
      [
        "C",
        "U"
      ],
      [
        "C",
        "GG"
      ],
      [
        "CC",
        "A"
      ],
      [
        "T",
        "GG"
      ],
      [
        "C",
        "GA"
      ],
      [
        "C",
        "AA"
      ],
      [
        "T",
        "GT"
      ],
      [
        "U",
        "A"
      ],
      [
        "C",
        "GT"
      ],
      [
        "TT",
        "A"
      ],
      [
        "C",
        "GC"
      ],
      [
        "GG",
        "GT"
      ],
      [
        "Ġ",
        "GG"
      ],
      [
        "T",
        "CC"
      ],
      [
        "AA",
        "A"
      ],
      [
        "G",
        "UU"
      ],
      [
        "GAA",
        "A"
      ],
      [
        "Ġ",
        "A"
      ],
      [
        "C",
        "TT"
      ],
      [
        "GA",
        "GG"
      ],
      [
        "GU",
        "A"
      ],
      [
        "T",
        "GC"
      ],
      [
        "T",
        "CT"
      ],
      [
        "C",
        "TA"
      ],
      [
        "GA",
        "U"
      ],
      [
        "T",
        "CA"
      ],
      [
        "GG",
        "GG"
      ],
      [
        "U",
        "AA"
      ],
      [
        "GC",
        "GA"
      ],
      [
        "GT",
        "GT"
      ],
      [
        "GCC",
        "A"
      ],
      [
        "T",
        "AA"
      ],
      [
        "CU",
        "A"
      ],
      [
        "C",
        "UU"
      ],
      [
        "GT",
        "A"
      ],
      [
        "CA",
        "CC"
      ],
      [
        "C",
        "GU"
      ],
      [
        "GG",
        "AA"
      ],
      [
        "GA",
        "GA"
      ],
      [
        "GC",
        "U"
      ],
      [
        "C",
        "GAA"
      ],
      [
        "GC",
        "AA"
      ],
      [
        "T",
        "GA"
      ],
      [
        "GC",
        "UU"
      ],
      [
        "TT",
        "TT"
      ],
      [
        "GC",
        "GG"
      ],
      [
        "C",
        "GGA"
      ],
      [
        "CA",
        "GG"
      ],
      [
        "CGT",
        "A"
      ],
      [
        "U",
        "GG"
      ],
      [
        "U",
        "CC"
      ],
      [
        "AA",
        "AA"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "TT",
        "CAA"
      ],
      [
        "C",
        "GCC"
      ],
      [
        "C",
        "GCA"
      ],
      [
        "UU",
        "A"
      ],
      [
        "GT",
        "AA"
      ],
      [
        "GUA",
        "GG"
      ],
      [
        "GG",
        "T"
      ],
      [
        "GC",
        "TT"
      ],
      [
        "GC",
        "TTA"
      ],
      [
        "GA",
        "T"
      ],
      [
        "GA",
        "TA"
      ],
      [
        "GT",
        "CA"
      ]
    ]
  }
}