{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          1
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "#": 4,
      "(": 5,
      ")": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "9": 19,
      "=": 20,
      "@": 21,
      "A": 22,
      "B": 23,
      "C": 24,
      "F": 25,
      "H": 26,
      "I": 27,
      "M": 28,
      "N": 29,
      "O": 30,
      "P": 31,
      "R": 32,
      "S": 33,
      "Z": 34,
      "[": 35,
      "\\": 36,
      "]": 37,
      "a": 38,
      "b": 39,
      "d": 40,
      "e": 41,
      "g": 42,
      "i": 43,
      "l": 44,
      "n": 45,
      "o": 46,
      "r": 47,
      "s": 48,
      "t": 49,
      "u": 50,
      "Ċ": 51,
      "č": 52,
      "Ġ": 53,
      "CC": 54,
      "](": 55,
      "(=": 56,
      "@@": 57,
      "]([": 58,
      "čĊ": 59,
      "NC": 60,
      "ĠC": 61,
      ")[": 62,
      "OC": 63,
      ")(": 64,
      "CCCC": 65,
      "CO": 66,
      "CCC": 67,
      "-]": 68,
      "ĠCC": 69,
      "Cl": 70,
      "OP": 71,
      "CN": 72,
      "([": 73,
      "@]": 74,
      ".[": 75,
      "@@]": 76,
      "CCCCCCCC": 77,
      ")/": 78,
      "+](": 79,
      "+]": 80,
      "ĠCOC": 81,
      "CCCCCCCCCCC": 82,
      "CCN": 83,
      "ĠCN": 84,
      "-])": 85,
      ")(=": 86,
      "Ġ[": 87,
      "SC": 88,
      "\\\\": 89,
      "=[": 90,
      "COP": 91,
      "-].[": 92,
      "CCOP": 93,
      "/[": 94,
      "Na": 95,
      "Fe": 96,
      "32": 97,
      "CNC": 98,
      "OCCN": 99,
      "(=[": 100,
      "+](=": 101,
      "+].[": 102,
      "COC": 103,
      "CCCN": 104,
      "12": 105,
      "Cd": 106,
      "OCC": 107,
      "34": 108,
      "ĠCCC": 109,
      ")([": 110,
      "CCCCCC": 111,
      "NCC": 112,
      "ĠCCCCCCCC": 113,
      "ĠCCNC": 114,
      "@](": 115,
      "CS": 116,
      "ĠCCCCCCCCCCCCCC": 117,
      "NS": 118,
      "CCO": 119,
      "ĠCCCC": 120,
      "@@](": 121,
      "CCCCO": 122,
      "As": 123,
      "Br": 124,
      "SP": 125,
      "-])[": 126,
      "ĠCCOP": 127,
      "43": 128,
      "OCO": 129,
      "CCCNC": 130,
      "(/": 131,
      "(\\\\": 132,
      ")\\\\": 133,
      "54": 134,
      "SCC": 135,
      "@@]([": 136,
      "ĠCNC": 137,
      "ĠCOP": 138,
      "CCCCC": 139,
      "SCSCC": 140,
      "ĠCCCSP": 141,
      "CSP": 142,
      "CSCC": 143,
      "@]([": 144,
      "Co": 145,
      "Ni": 146,
      "NCCC": 147,
      "Pd": 148,
      "-][": 149,
      "ĠCCN": 150,
      ")/[": 151,
      "CCNCC": 152,
      "23": 153,
      "Hg": 154,
      "OCCCC": 155,
      "Pb": 156,
      "Zn": 157,
      "]\\\\": 158,
      "ĠCCCCCC": 159,
      "CCOC": 160,
      "-]#": 161,
      "ĠCCOC": 162,
      "ĠCCCCOC": 163,
      "CCCCCF": 164,
      "21": 165,
      "Mn": 166,
      "NH": 167,
      "NN": 168,
      "NCCCC": 169,
      "Pt": 170,
      "Ru": 171,
      "])": 172,
      "]=": 173,
      "ĠO": 174,
      "ĠCCCN": 175,
      "CCNC": 176,
      "CCOCC": 177,
      "](/": 178,
      "NCP": 179,
      ")(/": 180,
      "CCCCN": 181,
      "-].": 182,
      "+]#": 183,
      "+]=[": 184,
      "\\\\[": 185,
      "125": 186,
      "ĠCCCCCCCCCC": 187
    },
    "merges": [
      [
        "C",
        "C"
      ],
      [
        "]",
        "("
      ],
      [
        "(",
        "="
      ],
      [
        "@",
        "@"
      ],
      [
        "](",
        "["
      ],
      [
        "č",
        "Ċ"
      ],
      [
        "N",
        "C"
      ],
      [
        "Ġ",
        "C"
      ],
      [
        ")",
        "["
      ],
      [
        "O",
        "C"
      ],
      [
        ")",
        "("
      ],
      [
        "CC",
        "CC"
      ],
      [
        "C",
        "O"
      ],
      [
        "CC",
        "C"
      ],
      [
        "-",
        "]"
      ],
      [
        "Ġ",
        "CC"
      ],
      [
        "C",
        "l"
      ],
      [
        "O",
        "P"
      ],
      [
        "C",
        "N"
      ],
      [
        "(",
        "["
      ],
      [
        "@",
        "]"
      ],
      [
        ".",
        "["
      ],
      [
        "@@",
        "]"
      ],
      [
        "CCCC",
        "CCCC"
      ],
      [
        ")",
        "/"
      ],
      [
        "+",
        "]("
      ],
      [
        "+",
        "]"
      ],
      [
        "ĠC",
        "OC"
      ],
      [
        "CCCCCCCC",
        "CCC"
      ],
      [
        "CC",
        "N"
      ],
      [
        "ĠC",
        "N"
      ],
      [
        "-]",
        ")"
      ],
      [
        ")",
        "(="
      ],
      [
        "Ġ",
        "["
      ],
      [
        "S",
        "C"
      ],
      [
        "\\",
        "\\"
      ],
      [
        "=",
        "["
      ],
      [
        "CO",
        "P"
      ],
      [
        "-]",
        ".["
      ],
      [
        "CC",
        "OP"
      ],
      [
        "/",
        "["
      ],
      [
        "N",
        "a"
      ],
      [
        "F",
        "e"
      ],
      [
        "3",
        "2"
      ],
      [
        "C",
        "NC"
      ],
      [
        "O",
        "CCN"
      ],
      [
        "(=",
        "["
      ],
      [
        "+](",
        "="
      ],
      [
        "+]",
        ".["
      ],
      [
        "C",
        "OC"
      ],
      [
        "CCC",
        "N"
      ],
      [
        "1",
        "2"
      ],
      [
        "C",
        "d"
      ],
      [
        "O",
        "CC"
      ],
      [
        "3",
        "4"
      ],
      [
        "Ġ",
        "CCC"
      ],
      [
        ")(",
        "["
      ],
      [
        "CCCC",
        "CC"
      ],
      [
        "N",
        "CC"
      ],
      [
        "Ġ",
        "CCCCCCCC"
      ],
      [
        "ĠCC",
        "NC"
      ],
      [
        "@",
        "]("
      ],
      [
        "C",
        "S"
      ],
      [
        "ĠCCCCCCCC",
        "CCCCCC"
      ],
      [
        "N",
        "S"
      ],
      [
        "CC",
        "O"
      ],
      [
        "Ġ",
        "CCCC"
      ],
      [
        "@@",
        "]("
      ],
      [
        "CCCC",
        "O"
      ],
      [
        "A",
        "s"
      ],
      [
        "B",
        "r"
      ],
      [
        "S",
        "P"
      ],
      [
        "-]",
        ")["
      ],
      [
        "ĠCC",
        "OP"
      ],
      [
        "4",
        "3"
      ],
      [
        "OC",
        "O"
      ],
      [
        "CCC",
        "NC"
      ],
      [
        "(",
        "/"
      ],
      [
        "(",
        "\\\\"
      ],
      [
        ")",
        "\\\\"
      ],
      [
        "5",
        "4"
      ],
      [
        "S",
        "CC"
      ],
      [
        "@@",
        "](["
      ],
      [
        "ĠC",
        "NC"
      ],
      [
        "ĠC",
        "OP"
      ],
      [
        "CCCC",
        "C"
      ],
      [
        "SC",
        "SCC"
      ],
      [
        "ĠCCC",
        "SP"
      ],
      [
        "CS",
        "P"
      ],
      [
        "CS",
        "CC"
      ],
      [
        "@",
        "](["
      ],
      [
        "C",
        "o"
      ],
      [
        "N",
        "i"
      ],
      [
        "N",
        "CCC"
      ],
      [
        "P",
        "d"
      ],
      [
        "-]",
        "["
      ],
      [
        "ĠCC",
        "N"
      ],
      [
        ")/",
        "["
      ],
      [
        "CCN",
        "CC"
      ],
      [
        "2",
        "3"
      ],
      [
        "H",
        "g"
      ],
      [
        "O",
        "CCCC"
      ],
      [
        "P",
        "b"
      ],
      [
        "Z",
        "n"
      ],
      [
        "]",
        "\\\\"
      ],
      [
        "Ġ",
        "CCCCCC"
      ],
      [
        "CC",
        "OC"
      ],
      [
        "-]",
        "#"
      ],
      [
        "ĠCC",
        "OC"
      ],
      [
        "ĠCCCC",
        "OC"
      ],
      [
        "CCCCC",
        "F"
      ],
      [
        "2",
        "1"
      ],
      [
        "M",
        "n"
      ],
      [
        "N",
        "H"
      ],
      [
        "N",
        "N"
      ],
      [
        "N",
        "CCCC"
      ],
      [
        "P",
        "t"
      ],
      [
        "R",
        "u"
      ],
      [
        "]",
        ")"
      ],
      [
        "]",
        "="
      ],
      [
        "Ġ",
        "O"
      ],
      [
        "Ġ",
        "CCCN"
      ],
      [
        "CC",
        "NC"
      ],
      [
        "CC",
        "OCC"
      ],
      [
        "](",
        "/"
      ],
      [
        "NC",
        "P"
      ],
      [
        ")(",
        "/"
      ],
      [
        "CCCC",
        "N"
      ],
      [
        "-]",
        "."
      ],
      [
        "+]",
        "#"
      ],
      [
        "+]",
        "=["
      ],
      [
        "\\\\",
        "["
      ],
      [
        "12",
        "5"
      ],
      [
        "ĠCCCCCCCC",
        "CC"
      ]
    ]
  }
}